Revit 2027 API
ElementSet.Erase Method
Removes a specified element from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Element item
)
Public Overridable Function Erase (
	item As Element
) As Integer
public:
virtual int Erase(
	Element^ item
)
abstract Erase :
        item : Element -> int
override Erase :
        item : Element -> int
Parameters
item Element
The element to be erased.
Return Value
Int32
The number of elements that were erased from the set.
See Also
Reference
ElementSet Class
Autodesk.Revit.DB Namespace